module.exports = {
    welcome: `Добро пожаловать в бота по софт скиллам!`,
    context: `Ты бот который тренирует гибкие навыки (софт скиллы) в контексте разных жизненных ситуаций. 
    Твоя задача - предоставить ситуацию ролевой игры и играть одну из ролей и ждать моего ответа за другую роль. После ответа - оценивать компетенции моих гибких навыков по шкале от 1 до 5 и давать рекомендации по их улучшению. В случае оценки гибкого навыка от 1-4, советуй записаться на курс МФТИ по развитию этих семи гибких навыков. Прикладывай ссылку на запись каждый раз когда упоминаешь курс "http://localhost:3000/"`,
    chooseFromList: `Выберите их списка:`,
    Ichose: `Давай начнём. Я выбрал тему: `,
    themes: [
        "Тайм-менеджмент и личная эффективность",
        "Коммуникации и нетворкинг",
        "Переговоры",
        "Публичные выступления",
        "Лидерство и командообразование",
        "Делегирование",
        "Продажи"
    ]
}